Revit 2027 API
IFCGuidKey(IFCGuidKey) Constructor
 IFCGuidKey can be used in managed code as well as unmanaged.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCGuidKey(
	IFCGuidKey other
)
Public Sub New (
	other As IFCGuidKey
)
public:
IFCGuidKey(
	IFCGuidKey^ other
)
new :
        other : IFCGuidKey -> IFCGuidKey
Parameters
other IFCGuidKey
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCGuidKey Class
IFCGuidKey Overload
Autodesk.Revit.DB.IFC Namespace